AUTO_config_TK_pesok/src/Tasks/ТК_ЗадачаТСД/ТК_ЗадачаТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ТК_ЗадачаТСД</name>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения задачи</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <comment>Дата и время фактического выполнения задачи</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание постановки задачи для исполнителя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ТК_ЗаявкаНаВозвратПоставщику</types>
      <types>DocumentRef.ТК_ЗаявкаНаПеремещение</types>
      <types>CatalogRef.ТК_ГрафикиТСД</types>
      <types>DocumentRef.ТК_ГрафикИнвентаризаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>EnumRef.ТК_ВидыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОтборов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

AUTO_config_TK_pesok/src/Enums/ТК_ВидыЗадачТСД/ТК_ВидыЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТК_ВидыЗадачТСД</name>
  <enumValues>
    <name>ВернутьПоставщику</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>ВерификацияЦенников</name>
  </enumValues>
  <enumValues>
    <name>ТБД</name>
  </enumValues>
  <enumValues>
    <name>ГрафикИнвентаризаций</name>
  </enumValues>
  <enumValues>
    <name>ГрафикТНП</name>
    <comment>Товар непригодный к продаже</comment>
  </enumValues>
  <enumValues>
    <name>Уведомление</name>
  </enumValues>
  <enumValues>
    <name>ПоказанияЭлектроСчетчиков</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Tasks/ТК_ЗадачаТСД/ManagerModule.bsl
Функция ПолучитьТоварыПоЗадаче(ЗадачаТСД)Экспорт
	
	МассивТоваров = Новый Массив;
	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗадачаТСД,"ВидЗадачи,ГруппаНоменклатуры,ХранилищеОтборов");	
	
	Если РеквизитыОбъекта.ВидЗадачи = Перечисления.ТК_ВидыЗадачТСД.ГрафикИнвентаризаций Тогда
		Настройки = РеквизитыОбъекта.ХранилищеОтборов.Получить();
		Если Настройки = Неопределено Тогда
			ВызватьИсключение("Неопределены настроки графика!");
		КонецЕсли;
		
		СхемаКомпоновкиДанных = ПолучитьОбщийМакет("СхемаКомпоновкиОтбораНоменклатуры");
		КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных); 
		
		ТаблицаРезультат = Новый ТаблицаЗначений; 
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений; 
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
		
		МассивТоваров = ТаблицаРезультат.ВыгрузитьКолонку("Номенклатура");

		
	ИначеЕсли ЗначениеЗаполнено(РеквизитыОбъекта.ГруппаНоменклатуры) Тогда
		МассивТоваров.Добавить(РеквизитыОбъекта.ГруппаНоменклатуры);
	КонецЕсли;
	
	Возврат МассивТоваров;

	
КонецФункции
